# Задание 1my_list = [12, 3.5, "единорог", True, False]for el in my_list:    print(type(el))# Задание 2list1 = input("Введите слова и цифры ")list1 = list1.split()list1 = list(list1)n = 0while n < len(list1) - 1:    list1[n], list1[n+1] = list1[n+1], list1[n]    n = n + 2 print(list1)# Задание 3month = int(input("Введите номер месяца "))seasons = {"зима" : [1, 2, 12], "весна" : [3, 4, 5], "лето" : [6, 7, 8], "осень" : [9, 10, 11]}for key, value in seasons.items():    if month in value:        print(f"это {key}") # Задание 4strochka = input("Введите предложение ")strochka = strochka.split()for ind, el in enumerate(strochka):    print(ind, el[0:10])# Задание 5rating = [7, 5, 3, 6, 2, 1]mark = int(input("Введите число для рейтинга "))if rating.count(mark) == 0:    rating.append(mark)else:    rating.insert(rating.index(mark) + 1, mark)   print(rating)# Задание 6result_list = []n = 1while n < 4:    item1 = {}    name = input("Введите название товара ")    item1["Название"] = name    price = int(input("Введите цену товара "))    item1["Цена"] = price    amount = int(input("Введите количество товара "))    item1["Количество"] = amount    unit = input("Введите единицу измерения ")    item1["Ед."] = unit        list1 = [n, ]    list1.append(item1)    tuple1 = tuple(list1)    result_list.append(tuple1)    n = n + 1print(result_list)names1 = []price1 = []amount1 = []unit1 = []n = 0while n < 3:    t = list(result_list[n])    m = t[1]        names1.append(m.get("Название"))    price1.append(m.get("Цена"))    amount1.append(m.get("Количество"))    unit1.append(m.get("Ед."))    n = n + 1analys = {"названия" : names1, "цены" : price1, "количество" : amount1, "Ед." : unit1}print(analys)